app/controllers/ownerships_controller.rb

INSERT INTO `ownerships` (`media_id`, `updated_at`, `movie_id`, `notes`, `user_id`, `count`, `created_at`) VALUES(6, '2009-07-11 14:28:09', 784, '', 2, 1, '2009-07-11 14:28:09')
SELECT * FROM `ownerships` WHERE (`ownerships`.user_id = 2 AND (movie_id = 784))
---
  def create
    params[:ownerships] ||= {}

    # Existing ownerships
    existing_attributes = params[:ownerships][:existing_viewship_attributes] || {}
    @ownerships.reject(&:new_record?).each do |ownership|
      attributes = existing_attributes[ownership.id.to_s]
      if attributes
        attributes.merge!({ :user => @user, :movie => parent_object })
        ownership.attributes = attributes
        ownership.save
      else
        ownership.destroy
      end
    end

    # New ownerships
    new_attributes = params[:ownerships][:new_viewship_attributes]
    if new_attributes
      new_attributes.each do |attributes|

SELECT * FROM `users` WHERE (`users`.`permalink` = 'adamfortuna') LIMIT 1
---
  def set_user
    @user = User.find_by_permalink params[:user_id] if params[:user_id]

SELECT * FROM `ownerships` WHERE (`ownerships`.user_id = 2 AND (movie_id = 784))
---
  def set_existing_ownerships
    @ownerships = @user.ownerships.find(:all, :conditions => ['movie_id = ?', parent_object.id])