app/controllers/users_controller.rb

  def show
    @user = User.find_by_permalink(params[:id])
---
SELECT * FROM `users` WHERE (`users`.`permalink` = 'adamfortuna') LIMIT 1