app/controllers/views_controller.rb

  def set_user
    @user = User.find_by_permalink params[:user_id] if params[:user_id]
---
SELECT * FROM `users` WHERE (`users`.`permalink` = 'adamfortuna') LIMIT 1